{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "clean_up_tokenization_spaces": true,
  "eos_token": "<|endoftext|>",
  "is_local": false,
  "local_files_only": false,
  "model_input_names": [
    "input_ids",
    "attention_mask"
  ],
  "model_max_length": 32768,
  "pad_token": "<|pad|>",
  "tokenizer_class": "TokenizersBackend"
}
